Revit 2027 API
Document.NewFlexDuct(IList<XYZ>, FlexDuctType) Method
Adds a new flexible duct into the document, using a point array and duct type.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlexDuct NewFlexDuct(
	IList<XYZ> points,
	FlexDuctType ductType
)
Public Function NewFlexDuct (
	points As IList(Of XYZ),
	ductType As FlexDuctType
) As FlexDuct
public:
FlexDuct^ NewFlexDuct(
	IList<XYZ^>^ points,
	FlexDuctType^ ductType
)
member NewFlexDuct :
        points : IList<XYZ> *
        ductType : FlexDuctType -> FlexDuct
Parameters
points IList<XYZ>
The point array indicating the path of the flexible duct, including the end points.
ductType FlexDuctType
 The type of the flexible duct.
Return Value
FlexDuct
 If creation was successful then a new flexible duct is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument points is null.
InvalidOperationException |  Thrown when the flexible duct cannot be created or regenerate fails.
ArgumentException | Thrown if the flexible duct type does not exist in the given document.
See Also
Reference
Document Class
NewFlexDuct Overload
Autodesk.Revit.Creation Namespace